Revit 2024 API
Zone.CalculatedCoolingLoad Property
Get the Calculated Cooling Load of the Zone.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public double CalculatedCoolingLoad { get; }
Visual Basic
Public ReadOnly Property CalculatedCoolingLoad As Double
	Get
Visual C++
public:
property double CalculatedCoolingLoad {
	double get ();
}
Remarks
This property is used to get the Calculated Cooling Load of the Zone.
See Also
Zone Class
Autodesk.Revit.DB.Mechanical Namespace